{"pageProps":{"frontmatter":{"date":"October 2020","cardTitle":"How improving your ability to learn can help you teach yourself to code more effectively","description":"Improving your ability to learn can help you teach yourself to code more effectively, saving you time and money.","tags":["beginner","learning"]},"markdownBody":"\n# What did you learn from that tutorial you just watched?\n\nIt's something we are all guilty of, we watch a video, attend a lecture, or read an article on a subject matter we wish to learn. We finish reading or watching, and often we feel a small sense of accomplishment that we have just learned something, we close our laptop, or close our book and we carry on with our day under the assumption that we have effectively learned something from this process. The truth is, learning is a **learned behaviour.** Whilst for a small, lucky, minority who have a gifted innate ability to easily absorb information really quickly, for the rest of us, that's not really the case. But it doesn't have to be that way. We **can** in fact become better at learning. Doing so could make all the difference in your code learning journey. It might not make you the next coding prodigy, but almost certainly will make you a better programmer.\n\n## Start with honesty\n![Person looking out over the ocean deep in thought](https://source.unsplash.com/01htj6kYvIo/1600x900)\n\n\nImproving your ability to learn can only ever work if you're honest with yourself. I know, I know, it sounds a little cliche I hear ya. But think about it, if you're truly honest with yourself (and this doesn't always mean being highly critical) this will open up many doors that will inevitably lead to self-improvement.\n\nIn the context of learning to code, this will become crucial - not only as you learn to code initially, but also throughout your career as a developer. Your ability to learn, and learn well, will be incredibly important to you as a developer. From the perspective of a Front End Developer, this couldn't be more true. The tech landscape on this side of the stack is forever changing, maturing, and evolving. With new frameworks and libraries around the corner every month or so, at some point in time you will almost certainly be required to learn something new, be it for a business purpose at work, a side project, or even for a new client.\n\n# Improve your learning process\n\nNow you're totally cool with being honest with yourself. Whatever you're currently learning there is always an improvement you can make to your processes (or lack thereof). For instance, let's say you want to teach yourself how to code with the end goal of becoming a Front End Developer. Let us assume you have a solid grasp of the fundamentals of HTML and CSS but now you wish to learn JavaScript. You decide to follow some online tutorial courses. The courses (like many) are structured as a progressive learning experience, i.e. you start with the very basic foundational concepts of the language and gradually move on to more challenging, tricky aspects. Whilst you rattle through a particular course, you are probably encouraged to build small, contrived projects as you go, and by the end of the course, you may work toward building something a little more substantial with the focus being to build upon the concepts you have covered during the course.\n\nWhat often happens with this approach, is that you get some way through the course, maybe just past the foundational concepts (maybe not even that far) and you hit a roadblock. This usually occurs when one of two things happen:\n\n* You start to explore more advanced concepts\n* You try to build some application or small project\n\nSadly, a lot of people become disheartened, their progress stalls, they think they're not good enough, not smart enough to code and this significantly hampers their learning process, they may even decide to give up entirely. Some onlookers may be thinking that's fine, this is just a way to whittle out those that aren't up to scratch and shouldn't be a developer in the first place. Well, in some cases that may be true, but in others, that is definitely **not** be the case. \n\nMost of these individuals will be self-teaching, they may be working a full-time job, have a family, and/or juggling lots of different things in their life at once. The solution for these individuals is multifaceted, it isn't just a 'one quick trick solution'. One particular facet of this solution will be improving their learning process. Time management will be in their too. But in keeping with the main topic of this article, we will focus on the learning process. Here are a few things these individuals could do to improve their process:\n\n### 1. Make some form of notes as you learn\n\nThe notes you make could be handwritten or they could be typed. They do not have to be extensive, and nor do they have to cover every nook and cranny of a particular topic. If you decide to write some more elaborate detailed notes then great, but most of the time a short list of key points and take-aways will suffice. Also noting down what you did not understand can be super useful, especially when you go back to reflect on these notes (which you should do). They could be as brief as this example which looks at the difference between `let` and `const` for example:\n\n* `let` and `const` are block-scoped.\n* If I want a variable to be reassignable I should use `let`.\n* When I do not intend for a variable to be reassignable I should always use `const`.\n* Using `const` will help safeguard against involuntary reassignments.\n\nMake sure you look over your notes. It's best to have a quick look either a few hours after you've written them or the next day. Essentially, once you're pretty sure you've forgotten them.\n\n### 2. Practically apply what you're learning\n\nWhilst you're learning - using the example above - open up the developer tools console, your IDE, or whatever coding environment you are using and test things out. If `const` is useful for protecting against involuntary reassignments, actually test it out. See if the console spits out an error when you try to reassign a variable with `const`.\n\nIf you're unsure of anything you're learning, always try and **test out any assumptions you may have**. Using developer tools is a perfect environment for doing this.\n\nPractically applying concepts can be tough, and a real blocker for many beginners. It hurts your brain, and it's always really easy to procrastinate at this point when things get challenging. But you should embrace these uncomfortable feelings! This is where the real learning occurs.\n\n### 3. Don't let time or fancy completion badges become your metric for progress\n\nJust because you've completed a section in a course, watched an entire video, or even read through an article, this doesn't mean you've learned what you needed to. Even if you've spent x amount of your allocated learning time on a particular topic, doesn't mean you've learned what you needed to either. The best metric you have for moving on with a course, topic, or learning resource is whether you have **understood** the material. In most cases, this will take a lot longer than you initially anticipate.\n\nWhat do I mean by 'understood'? In my opinion, this means that you are able to verbally explain out loud the topic you're learning (this can still be fairly broad) and additionally be able to explain this with code. Using our JavaScript variable example above, could you explain those concepts to yourself verbally? Could you also demonstrate that you understand said concepts with code in the console too?\n\nExplaining something to yourself out loud can be a really useful learning tool. Mostly because it's quite uncomfortable and often you quickly realise how little you actually know about a given topic.\n\n\n### 4. Once you have understood, move on.\n\nThis is a super important point too! Don't become obsessive about understanding something, there is a fine line between trying to understand something and then trying to memorise something. I would advice against memorising progamming concepts. There is too much content to memorise. Plus, there is no need. You have the internet at hand and a plethora of resources at your fingers tips to jog your memory if you have forgotton the name of a particular array method, for instance.\n\nWhat's crucial, is that you feel comfortable with your understanding of a given topic. Once you do, you should move on.\n\n\n### 5. Don't be afraid to go over something again.\n\nOnce again, I will echo what I said above, this is not the same as memorising something. If you thought you understood a topic and you subsequently moved on only to realise when future content became more complex that in fact, you didn't really understand, then you should go back and cover that content until you do. If you understood said topic fully, but in the future, you appear to have forgotten it, a quick Google search will jog your memory and you'll realise that in actual fact you only needed a quick reminder.\n\n### 6. Beware of the rabbit hole\n\n![Looking up, out of a hole toward the sky](https://source.unsplash.com/jNSJE8dMro0/1600x900)\n\nFinding yourself in a rabbit hole is a common occurrence in the development world. Learning when it's okay to carry on down the hole and when you should climb back out is the real challenge. For those teaching themselves to code and just starting out, try to stick closely to the topic you are covering. Just learn what you need to learn for now. It's not possible to cover everything.\n\nUsing our JavaScript variable example above, you may find your variable research leads you to something called 'scope'. If you have no understanding of scope at this time, it may be best to move on for now and come back to this more advanced topic when you are ready. Do note, I'm not saying you *shouldn't* learn about scope in JavaScript, I'm merely suggesting you focus on one learning one topic (if you can) in detail at a time.\n\n\n## Final thoughts\n\nYour best metric for your progress is achieving a solid understanding of your learning topics. As mentioned at the beginning of this article, for you to be able to improve your own learning ability you need to be **honest** with yourself when you don't understand. Following the learning points above may seem time-consuming and overly cumbersome at first, but in reality, you'll save time in the long run. Even better, you'll gain a deep and thorough understanding of many development concepts that will stand you in good stead for a career of learning.\n\n"},"__N_SSG":true}